#1 Список покупок
shopping_list : list[str] = ["хліб", "молоко", "печиво", "вода", "морозиво"]
print(shopping_list)
shopping_list.append("чай в пакетиках")
print(shopping_list)

#2 Розрахунок середнього балу
marks_list : list[int] = [9, 10, 12, 11, 11, 12, 10]
marks = marks_list
середній_бал = sum(marks) / len(marks)
print("Середній бал :", середній_бал)

#3 Сортування імен
names_list : list[str] = ["Оля", "Соня", "Анастасія", "Вова"]
names_list.sort()
print("Імена в алфавітному порядку :", names_list)

#4 Робота з елементами списку
міста_list : list[str] = ["Київ", "Херсон", "Чернівці", "Львів"]
міста_list[2] = "Одеса"
print("Перше місто :", міста_list[0])
print("Останнє місто :", міста_list[-1])

#5 Твій власний список
фільми : list[str] = ["Форсаж", "Міс Конгеніальність", "Рівердейл", "Стіч"]
фільми.remove("Стіч")
фільми.reverse()
print(фільми)